perf-tests/artillery/scenarios/admin-baseline.yml
config:
  target: "{{ $processEnvironment.API_BASE_URL }}"
  phases:
    - name: warmup
      duration: 20
      arrivalRate: 1
      rampTo: 5
    - name: baseline
      duration: 60
      arrivalRate: 5
      rampTo: 15
  plugins:
    expect: {}
  defaults:
    headers:
      Authorization: "Bearer {{ $processEnvironment.API_ADMIN_TOKEN }}"
  ensure:
    thresholds:
      - "http.response_time.p95": 1500
      - "http.errors.rate": 0.01
scenarios:
  - name: admin-dashboard
    flow:
      - get:
          url: "/api/admin/dashboard/stats"
          expect:
            - statusCode: 200
      - get:
          url: "/api/admin/users?page=1&limit=20"
          expect:
            - statusCode: 200